<?php
/**
 **
 * 2. Доступ к коментам по проверке на участие в таске?(чтоб нельзя было прописать в адресной строке)?????.
 *
 *
 * 3. Редактировать ссылки --- и кнопки на тасках +++
 *
 * 4. При отсутствии комментариев - несуществует страница, нужно редирект на Create ?????.
 *
 *
 * 6. Добавить статусы на главной странице тасков ++++, и отслеживать их. -----
 *
 *
 *          Переводы, исправить длинну инпутов при создании
 *          Изменить названия таблиц, на справочники
 *          Убрать кнопки редактирования при просмотре, сделать редирект при создании на индекс
 *
 *          Добавить коментарии

 *          Скрыть пароль при редактировании, просмотре
 *
 *
 * 11. Добавить вывод короткого фио в поле owner_id в Task index
 *
 * 12. По проведению задачи, закрывать возможность комментов ??? и выводить статус, и итоги проведения задачи ???
 *
 * ???1. Добавить првоерку поля "Last Comment" на активность - если за последние 1-2 дня небыло комментариев - изменять цвет иконки
 * ???2. Поправить блоки, увеличить по ширине
 * ???3. Поправить Стили
 * ???7. Добавить поле - "последний коментарий" где выводить дату последних комментариев( возможно отображение в виде иконки, или уведомления ).++++/----
 *
 *
 */